package week3;

/**
 * 3. Из данного предложения, каждое четное слово инвертировать (0, 2, 4, ...), в каждом нечетном слове удалить каждую четную букву (0, 2, 4, ...).
 * Результат выводить на консоль.
 *
 * В качестве разделителя слов использовать пробел
 *
 * Ввод:
 * Как решить это задание и не сломать себе голову?
 *
 * Вывод:
 * каК ршт отэ здне и н ьтамолс сб ?уволог
 */
public class Task4 {
    public static void main(String[] args) {

        String text = args[0];

        //        Yours code...

    }
}
